[{
        "title": "Label China as Currency Manipulator",
        "state": "fail",
        "text": "President Donald Trump said on Wednesday that his administration will not label China a currency manipulator, backing away from a campaign promise, even as he said the U.S. dollar was \"getting too strong\" and would eventually hurt the economy.",
        "link": "http://fortune.com/2017/04/12/trump-china-currency-manipulator/",
        "rationale": "After being very vocal, on the campaign trail, about how China is a cheater and should be punished it took only a few meetings with the Chinese President to go back on that."
    },
    {
        "title": "Defund Planned Parenthood",
        "state": "pending",
        "text": "With a rare tie-breaking vote from Vice President Mike Pence, the Senate on Thursday sent a bill to President Donald Trump’s desk giving states permission to withhold federal family planning funds from Planned Parenthood and other abortion providers. Trump did not sign into law, yet.",
        "link": "http://www.politico.com/story/2017/03/mike-pence-johnny-isakson-planned-parenthood-vote-senate-236702",
        "rationale": "Although this is obviously a win, it's still marked as pending till after it is signed into law by Trump."
    },
    {
        "title": "End the War on Coal",
        "state": "success",
        "text": "President Trump, flanked by company executives and miners, signed a long-promised executive order on Tuesday to nullify President Barack Obama’s climate change efforts and revive the coal industry, effectively ceding American leadership in the international campaign to curb the dangerous heating of the planet.",
        "link": "https://www.nytimes.com/2017/03/28/climate/trump-executive-order-climate-change.html?_r=0",
        "rationale": "Although the oceans may boil as a result, this is a win for the President as he delivers a campaign promise."
    },
    {
        "title": "Muslim Ban - 2nd try",
        "state": "fail",
        "text": "The Hawaii federal judge who blocked portions of President Trump's revised Muslim travel ban two weeks ago, ruled to extend the hold indefinitely on Wednesday.",
        "link": "http://www.slate.com/blogs/the_slatest/2017/03/29/hawaii_federal_judge_extends_block_on_trump_s_muslim_travel_ban.html",
        "rationale": "This is a fail since, again, the President did not deliver on his campaign promise."
    },
    {
        "title": "Repeal and Replace Obamacare",
        "state": "fail",
        "text": "House Republican leaders, facing a revolt among conservatives and moderates in their ranks, pulled legislation to repeal the Affordable Care Act from consideration on the House floor Friday in a major defeat for President Trump on the first legislative showdown of his presidency.",
        "link": "https://www.nytimes.com/2017/03/24/us/politics/health-care-affordable-care-act.html?_r=0",
        "rationale": "After repeatedly promising to Repeal and Replace, the President own party failed to approve the American Health Care Act. This should be counted as two fails, considering the GOP has the majority..."
    },
    {
        "title": "National Security Adviser",
        "state": "fail",
        "text": "Michael T. Flynn, the national security adviser, resigned on Monday night after it was revealed that he had misled Vice President Mike Pence and other top White House officials about his conversations with the Russian ambassador to the United States.",
        "link": "https://www.nytimes.com/2017/02/13/us/politics/donald-trump-national-security-adviser-michael-flynn.html",
        "rationale": "This is a fail because a resignation of a National Security Adviser, a highly trusted position by all accounts, due to trust issues is a fail."
    },
    {
        "title": "Muslim Ban",
        "state": "fail",
        "text": "A federal appeals panel has maintained the freeze on President Trump’s controversial immigration order, meaning previously barred refugees and citizens from seven majority-Muslim countries can continue entering the United States.",
        "link": "https://www.washingtonpost.com/world/national-security/federal-appeals-court-maintains-suspension-of-trumps-immigration-order/2017/02/09/e8526e70-ed47-11e6-9662-6eedf1627882_story.html?utm_term=.aa5fbcca8c2b",
        "rationale": "This is a fail as the Executive Order effectively was canceled by a federal judge."
    },
    {
        "title": "Border Wall paid for by Mexico",
        "state": "pending",
        "text": "Executive Order was signed. No further progress.",
        "link": "https://www.whitehouse.gov/the-press-office/2017/01/25/executive-order-border-security-and-immigration-enforcement-improvements",
        "rationale": "Still pending because an executive order without any budget, and with the Mexican President making fun of you, is not a win. It's not a lose, yet, either."
    },
    {
        "title": "Win Elections",
        "state": "success",
        "text": "Donald Trump Wins the 2016 Election with 306 out of 538 electoral votes.",
        "link": "http://time.com/4563685/donald-trump-wins/",
        "rationale": "Because, really, how many persons can say they did that?! (45, it seems)."
    }
]